Kinsey_Dumas/pitch_plunge_custom/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          160;
        startFace       54828;
    }
    inlet
    {
        type            patch;
        nFaces          104;
        startFace       54988;
    }
    outlet
    {
        type            patch;
        nFaces          104;
        startFace       55092;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       55196;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          27314;
        startFace       55412;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          27314;
        startFace       82726;
    }
)

// ************************************************************************* //
